HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_OFF (12)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_LEN (1)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_OFF (13)

/** \\brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3)

/** \\brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.CHRUN */
#define IFX_DSADC_GLOBRC_CHRUN_LEN (6)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.CHRUN */
#define IFX_DSADC_GLOBRC_CHRUN_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.CHRUN */
#define IFX_DSADC_GLOBRC_CHRUN_OFF (0)

/** \\brief  Length for Ifx_DSADC_GLOBRC_Bits.MRUN */
#define IFX_DSADC_GLOBRC_MRUN_LEN (6)

/** \\brief  Mask for Ifx_DSADC_GLOBRC_Bits.MRUN */
#define IFX_DSADC_GLOBRC_MRUN_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_GLOBRC_Bits.MRUN */
#define IFX_DSADC_GLOBRC_MRUN_OFF (16)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODREV */
#define IFX_DSADC_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODREV */
#define IFX_DSADC_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODREV */
#define IFX_DSADC_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_DSADC_ID_Bits.MODTYPE */
#define IFX_DSADC_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_DSADC_ID_Bits.MODTYPE */
#define IFX_DSADC_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_ID_Bits.MODTYPE */
#define IFX_DSADC_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_OFF (29)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_BF_H */
